export const state = () => ({
  data: [
    {
      date: 'Сегодня',
      news: [
        {
          time: '11:34',
          title: 'Новосибирск вошел в топ самых дорогих миллионников',
          text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
          city: 'Новосибирск'
        },
        {
          time: '12:00',
          title: 'Минусовая температура и снегопады в Новосибирске',
          text: 'В столице Сибири установится довольно холодная погода: по утра и ночью температура воздуха будет опускаться до -1°С, днем не больше +2...+5°С. Снегопады, дожди.',
          city: 'Новосибирск'
        },
        {
          time: '14:00',
          title: 'Новосибирск вошел в топ самых дорогих миллионников',
          text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
          city: 'Новосибирск'
        },
        {
          time: '11:34',
          title: 'Новосибирск вошел в топ самых дорогих миллионников',
          text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
          city: 'Новосибирск'
        },
        {
          time: '11:34',
          title: 'Новосибирск вошел в топ самых дорогих миллионников',
          text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
          city: 'Новосибирск'
        }
      ]
    },
    {
      date: '20 октября',
      news: [
        {
          time: '11:34',
          title: 'Новосибирск вошел в топ самых дорогих миллионников',
          text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
          city: 'Новосибирск'
        },
        {
          time: '12:00',
          title: 'Минусовая температура и снегопады в Новосибирске',
          text: 'В столице Сибири установится довольно холодная погода: по утра и ночью температура воздуха будет опускаться до -1°С, днем не больше +2...+5°С. Снегопады, дожди.',
          city: 'Новосибирск'
        },
        {
          time: '14:00',
          title: 'Новосибирск вошел в топ самых дорогих миллионников',
          text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
          city: 'Новосибирск'
        },
        {
          time: '11:34',
          title: 'Новосибирск вошел в топ самых дорогих миллионников',
          text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
          city: 'Новосибирск'
        },
        {
          time: '11:34',
          title: 'Новосибирск вошел в топ самых дорогих миллионников',
          text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
          city: 'Новосибирск'
        }
      ]
    },
    {
      date: '19 октября',
      news: [
        {
          time: '11:34',
          title: 'Новосибирск вошел в топ самых дорогих миллионников',
          text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
          city: 'Новосибирск'
        },
        {
          time: '12:00',
          title: 'Минусовая температура и снегопады в Новосибирске',
          text: 'В столице Сибири установится довольно холодная погода: по утра и ночью температура воздуха будет опускаться до -1°С, днем не больше +2...+5°С. Снегопады, дожди.',
          city: 'Новосибирск'
        },
        {
          time: '14:00',
          title: 'Новосибирск вошел в топ самых дорогих миллионников',
          text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
          city: 'Новосибирск'
        },
        {
          time: '11:34',
          title: 'Новосибирск вошел в топ самых дорогих миллионников',
          text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
          city: 'Новосибирск'
        },
        {
          time: '11:34',
          title: 'Новосибирск вошел в топ самых дорогих миллионников',
          text: '40% новосибирцев оценивают жизнь в городе как дорогую. Одними из самых «кусачих» горожане считают цены на жилье, ЖКХ, проезд, бензин медицину, одежду и обувь.',
          city: 'Новосибирск'
        }
      ]
    }

  ],
  navigation: [
    { name: 'О редакции', path: '/' },
    { name: 'Популярное', path: '/' },
    { name: 'База контактов', path: '/' },
    { name: 'Новости', path: '/' },
    { name: 'Пользовательское соглашение', path: '/' }
  ],
  footer: {
    description: '© ООО «СИБИРЬ РАБОТАЕТ», 2022. Сообщения и материалы сетевого издания «СИБИРЬ РАБОТАЕТ» (зарегистрировано Федеральной службой по надзору в сфере связи, информационных технологий и массовых коммуникаций (Роскомнадзор) 03.12.2022 за номером ЭЛ №ФС77-82385) сопровождаются пометкой «СИБИРЬ РАБОТАЕТ». Отдельные публикации могут содержать информацию, не предназначенную для пользователей до 18 лет.',
    social: [
      { name: 'instagram', path: '/' },
      { name: 'ok', path: '/' },
      { name: 'facebook', path: '/' },
      { name: 'twitter', path: '/' },
      { name: 'pinterest', path: '/' },
      { name: 'spotify', path: '/' },
      { name: 'vk', path: '/' },
      { name: 'telegram', path: '/' },
      { name: 'youtube', path: '/' },
      { name: 'yandex-music', path: '/' },
      { name: 'subtract', path: '/' }
    ]
  }
})

export const getters = {}

export const actions = {}

export const mutations = {}
